
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/scarowar/test-terraform-branch-deploy/actions/runs/21106808191)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: dev
            Message: Development environment test
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment = "dev"
  + file_path   = "./output.txt"
local_file.test: Creating...
local_file.test: Creation complete after 0s [id=df0f31878e5f2f26f5be0387d768419c0f49af3b]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

environment = "dev"
file_path = "./output.txt"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":156,"Program":"tfcmt","SHA1":"25747efbd324daa089dc9942515dba7aadf910c6","Vars":{},"WorkflowName":"Terraform Deploy"} -->